{
    "link": null,
    "title": "A Call for Donations",
    "first_img": [],
    "second_img": null,
    "body": "<div ><p><img loading=\"lazy\" class=\"alignleft size-full wp-image-12290\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2020/02/taotou.jpg\" alt=\"\" width=\"300\" height=\"460\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2020/02/taotou.jpg 300w, https://fitgirl-repacks.site/wp-content/uploads/2020/02/taotou-196x300.jpg 196w\" sizes=\"(max-width: 300px) 100vw, 300px\">Once in a while I create posts like this. And I hate ’em. The last one was made more than a year ago, when the incoming donations question raised high. The same situation happens again. A few months ago my mining donations has been stopped, and now it seems to be  gone permanently. So the only way I can accept donations returned back to the roots – <div><a href=\"https://fitgirl-repacks.site/donations/\">classic crypto transactions</a></div>.</p><p>In 2019 year I had to switch to a more powerful hosting due to increased site traffic and had to lease another, more powerful seedbox. Unfortunately, just a tiny little small percentage of people actually donate something. Then we see copycat sites like fitgirl-repacks.cc and fitgirlrepacks.co, which simply use my design, my posts etc., but they have replaced my BTC/ETH/… donation addresses to their own. And some poor souls just send them their money w/o knowing they are feeding the crooks.</p><p>Long story short – that stash that was accumulated via donation mining and direct donations for a year is almost depleted now.</p><p>And, this post is, like, BUMP. So if you have free money you could donate to the cause – proceed to my <a href=\"https://fitgirl-repacks.site/donations/\">Donation page</a> and see the ways you can financially make this site running. Even if you don’t have any crypto – there are easy ways of buying it. Especially when BTC is on the rise and you can make some %$ in the future 🙂</p><h2>A Call for Donations</h2><ul><li>No, I can’t accept money donations via PayPal and similar services. Guess why.</li><li>No, I won’t run any ads on my site. Probably I could place a small seedbox company ads in exchange for a powerful seedboxes, but I never received such proposals 🙂</li></ul><p>And once again my “Thank you!” goes not only to people who help to seed and mirror my repacks (you know who you are, guys :), but to those who help me cover costs for supporting this site. I don’t know your names, but you help everyone here. Thank you.</p>             </div>"
}