{
    "link": null,
    "title": "Amelie Report October 2021",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><img loading=\"lazy\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2021/11/report_cover.jpg\" alt=\"\" width=\"827\" height=\"436\" class=\"alignnone size-full wp-image-22863\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2021/11/report_cover.jpg 827w, https://fitgirl-repacks.site/wp-content/uploads/2021/11/report_cover-300x158.jpg 300w, https://fitgirl-repacks.site/wp-content/uploads/2021/11/report_cover-768x405.jpg 768w\" sizes=\"(max-width: 827px) 100vw, 827px\"></p><p>I’ve wanted to make this report right after October ended, but the avalanche of games continued to such an extent that I could not sit and make all the necessary calculations I wanted. But still, the data didn’t change and here it is, my report for October 2021</p><p>So, in October alone I’ve repacked a total of <strong>157 games</strong>, which equals <strong>5.06 games per day</strong>. <strong>128</strong> (82%) of all games were new releases, while <strong>29</strong> (18%) were updated ones.</p><p>The source size of all releases, most of which are scene ISOs, is equal to <strong>1370 GB (1.33 TB)</strong>, which unpack to a size of <strong>1905 GB (1.86 TB)</strong>. The average unpacked size of the game comes to about <strong>8.7 GB</strong>, while the median size is only <strong>5.1 GB</strong>. Median here means that half of the games are larger than 5.1 GB and the rest half are smaller.</p><p>When packed, those games take up <strong>from 698 GB to 808 GB</strong>, depending on selected components, which is basically <strong>half of the scene release sizes</strong>. The minimum average repack size comes to about <strong>4.5 GB</strong>, while the median size is only <strong>1.9 GB</strong>.</p><p>The smallest game of October is <strong>CADE PRIME</strong> (730 MB -&gt; 220 MB) whereas the largest game is <strong>Conan Exiles: Complete Edition</strong> (105 GB -&gt; 45.5 GB).</p><p>The worst compression ratio recorded is for <strong>Disco Elysium: The Final Cut</strong> (9.5 GB –&gt; 7.8 GB, only 17.9% saved), while the best result recorded is for <strong>Boomerang X</strong> (10.8 GB –&gt; 859 MB, with a whopping amount of <strong>92% traffic saved</strong>).</p><p>The processing speed was <strong>63.5 GB</strong> of original unpacked data per day (<strong>2.6 GB per hour</strong>, <strong>44 MB per minute</strong>), which includes unpacking of original ISOs, analyzing, preparation and compression. Compression writing speed was basically half of those numbers.</p><p>Now, let’s check installation timings. Usually, every repack description contains two numbers (from-to), where the fastest one(from) is expected installation on a modern 16-threaded CPU with at least 16 GB of RAM, while the latter(to) is for older 4-threaded CPU with 8 GB of RAM. If the description only contains one number – it signifies that the installation doesn’t depend on CPU threads or it’s fast by default.</p><p>Also, stats show that the average repack installation time on a 16-threaded PC is <strong>4 minutes 20 seconds</strong> with median timing being even lower, that is <strong>only 2 minutes</strong>. For slower machines, those numbers are <strong>9 and 3 minutes respectively</strong>. Of course, there are slow installations (<strong>Killing Floor 2</strong> will be killing your PC for two hours on a 4-threaded CPU), but average numbers are pretty low.</p><p>Another interesting observation from the mined data is the average data reading/writing speed, which can be calculated from the table. On faster machines with reading speeds at <strong>20 MB/sec</strong>, the average repack writes at <strong>50 MB/sec</strong>. This includes internal processing: decompression of data and recompression to the game’s native format. Of course, repacks without recompressed data can read and write at a speed close to your maximum disk throughput, but you can’t really expect a “copy speed” when dealing with more complex repacks.</p><p>Slower PC gives you ~<strong>10 MB/sec</strong> reading and <strong>24 MB/sec</strong> writing speeds respectively.</p><p>If you have a laptop CPU, then you can multiply the installation speed by a factor of 2. If you have an active antivirus, then multiply it by a factor of 1.2-2, but if you have an aggressive antivirus which checks ALL read/write data on the fly, then multiply it by a factor of 2-4. Yes, you guessed it right, being dumb is costly in 2021.</p><p>Well, this winds it up. I hope you all find my above small revelations to be insightful and intriguing. I’m planning to repeat this again in a year and compare the future data with my earlier findings – we’ll again dive in and see how game sizes change, what’s up with the installation times, etc.</p><p>Yours Sincerely,<br>FitGirl Mk.21</p><div style=\"float:left;width: 45%\"><a target=\"_blank\" href=\"https://imageban.ru/show/2021/11/21/7121f55bf3a1510f9139059affd7b315/png\" rel=\"noopener\"><img src=\"https://i5.imageban.ru/thumbs/2021.11.21/7121f55bf3a1510f9139059affd7b315.png\" border=\"0\"></a></div><div style=\"float:right;width: 45%\"><img loading=\"lazy\" src=\"https://i.pinimg.com/originals/9e/d4/4a/9ed44af2369e1823efdc247fa62fc9a2.gif\" alt=\"\" width=\"500\" height=\"238\" class=\"alignright\"></div>             </div>"
}