{
    "link": null,
    "title": "Browser Mining as a Way of Donating",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><img src=\"https://fitgirl-repacks.site/wp-content/uploads/2017/10/pic.jpg\" alt=\"\" width=\"100%\" class=\"aligncenter wp-image-5399\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2017/10/pic.jpg 1024w, https://fitgirl-repacks.site/wp-content/uploads/2017/10/pic-300x138.jpg 300w, https://fitgirl-repacks.site/wp-content/uploads/2017/10/pic-768x353.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"><br>Hello, my dears. </p><p>Maybe you’ve heard some news about <a href=\"https://torrentfreak.com/the-pirate-bay-website-runs-a-cryptocurrency-miner-170916/\" rel=\"noopener\" target=\"_blank\">The Pirate Bay testing the mining</a> of <a href=\"https://en.wikipedia.org/wiki/Monero_(cryptocurrency)\" rel=\"noopener\" target=\"_blank\">Monero cryptocurrency</a> in users’ browsers. While this technology is not new, TPB made it public and looking pretty scary. The reason is simple – they did it silently, hijacking CPU power without their consent. But the principles lying in that technology can change the face of how users may “repay” the sites and services and make them drop advertising as a primary income source.</p><p>One of the great sites which adopted this technology properly is <a href=\"https://goodolddownloads.com/\" rel=\"noopener\" target=\"_blank\">GoodOldDownloads.com</a>, made by superb members of <a href=\"https://cs.rin.ru/forum/viewforum.php?f=10\" rel=\"noopener\" target=\"_blank\">RIN.ru community</a>. If you click on “Donate” button there, you will open a special menu, giving you an option of mining a Monero currency in behalf of the site admins. With just percentage of users who gave a fraction of their CPU power, GOD now can function more stable and proper, giving all of you direct links to GOG releases, which are usually much harder to find.</p><p>While having a traditional way of receiving donations via BitCoin I think that Monero browser mining is a very interesting stuff. I get messages daily about other ways I could receive your donations, but for security reasons BTC is currently the only one. But let’s see, if you share my opinion about donations via browser mining. More donations mean more seedboxes I could lease, which means more speed for you all.</p><p>Rest assured, that I WILL NEVER RUN ANY MINER WITHOUT YOUR CONSENT. If I adopt the tech for my site, it will be a button like GOD have and you will have to run the miner manually and let it run in the tab for a time you want it to run.</p><p>So, please vote and leave your thoughts in comments section.</p><p><script type=\"text/javascript\">(function(d, s, id){  var js,      fjs = d.getElementsByTagName(s)[0],      r = Math.floor(new Date().getTime() / 1000000);  if (d.getElementById(id)) {return;}  js = d.createElement(s); js.id = id; js.async=1;  js.src = \"https://www.opinionstage.com/assets/loader.js?\" + r;  fjs.parentNode.insertBefore(js, fjs);}(document, 'script', 'os-widget-jssdk'));</script></p><div class=\"os_poll\" data-path=\"/polls/2464408\" id=\"os-widget-2464408\"></div>             </div>"
}