{
    "link": null,
    "title": "CoD Black Ops 3 Repack Status",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p>Oh, I know. This is the longest repack I ever done. And it’s even outdated already (not something you should care, actually). But finally, it’s done. I mean I’ve made all proper installation tests (each of them took hours). The problem was the complexity of repack, ability to download lossy audio and excessive selective options.</p><p>Just look at this BIN-files list. I definitely have to write a guide for it! 🙂</p><div class=\"su-spoiler su-spoiler-style-fancy su-spoiler-icon-plus su-spoiler-closed\" data-scroll-offset=\"0\" data-anchor-in-url=\"no\"><div class=\"su-spoiler-title\" tabindex=\"0\" role=\"button\"><span class=\"su-spoiler-icon\"></span>Prepare another pair of pants for change</div><div class=\"su-spoiler-content su-u-clearfix su-u-trim\"><img loading=\"lazy\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2016/12/bo3_list.png\" alt=\"\" width=\"752\" height=\"1561\" class=\"aligncenter size-full wp-image-2737\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2016/12/bo3_list.png 752w, https://fitgirl-repacks.site/wp-content/uploads/2016/12/bo3_list-145x300.png 145w, https://fitgirl-repacks.site/wp-content/uploads/2016/12/bo3_list-493x1024.png 493w\" sizes=\"(max-width: 752px) 100vw, 752px\"><br></div></div><p>There are 3 installers for this repack. One for main data, one for lossy audio and one for lossless. I made it that way so you could easily switch from lossy to lossless option later, if you like, without reinstalling the whole game.</p><p>Installation times are following (for SP only): ~2-3 hours for main data; ~10 minutes for lossless audio; ~1 hour for lossy audio. If you add Zombie Mode or Multiplayer with bots – add some hours above. If you’re really insane – you may install ALL modes + ALL languages to get the largest game installation ever available (lossy audio installation is not recommended for “all in mode” – it will easily take half a day!).</p><p>Here are the example sizes of the repack for English language (other languages vary a little bit):</p><p>SP with lossy audio: 32.4 GB<br>SP with lossless audio: 38.7 GB<br>SP + Zombies with lossy audio: 38.6 GB<br>SP + Zombies with lossless audio: 47.7 GB<br>SP + Multiplayer with lossy audio: 39.2 GB<br>SP + Multiplayer with lossless audio: 46.6 GB<br>SP + Zombies + Multiplayer with lossy audio: 45.4 GB<br>SP + Zombies + Multiplayer with lossless audio: 55.5 GB (Complete lossless pack)</p><p>Three updates were released after my repack was done. One of them is cracked. But, AFAIK, none of them introduce anything for SP/MP/ZM modes, only fixes for online players.</p><p>I may return to BO3 next year, cause developers mentioned that they may add another DLC. Dunno if I’m gonna redo the whole repack, relatively big patch seems more sane in this case.</p><p>As for release date – now I have to write the whole guide for installing it. Or many of you will lost in files 🙂</p>             </div>"
}