{
    "link": null,
    "title": "CoDs repacks status",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><strong>Update #6, November 12 – The last</strong>: IW repack is done. <span style=\"color: #339966;\"><strong>37.7 GB</strong></span> in minimum set (SP only for any single language, lossless). Optional MP/Zombie add-on available in case somebody will find a way to make those modes work. Release – on November 13.</p><p><strong>Update #5, November 11</strong>: Lossy audio doesn’t work with IW as well. Bummer. Still, main game files can be compressed pretty good, and MP/Zombie content will be available as an optional content. Seems like BO3 is the only CoD, which works with lossy audio. Or should I test the game more? 🙂 Good news – as I don’t need to make audio lossy, repack will be released much faster. No ETA yet, but FASTER.</p><p><strong>Update #4</strong>: Lossy audio triggers some in-game triggers, which stops you from proceeding, so no lossy option for this game, just pure lossless. Sorry, but that’s why I test my games. Dunno if the same bug will appear with lossy audio in IW, it works just fine in BO3 and sound containers in these two are almost the same, unlike ones used in MWR.</p><p><strong>Update #3, Nov 8</strong>: MWR repack is ready and is in installation tests now. The minimum size is <strong><span style=\"color: #339966;\">~26.7 GB</span></strong> for any single language (<del datetime=\"2016-11-08T02:50:52+00:00\">lossy OPUS audio + </del>menu animated backgrounds made static). Complete lossless set for any single language is <span style=\"color: #339966;\"><strong>28 GB</strong></span>. Yet another smallest repack in the world. Planning to release it today, but may be delayed for tomorrow.</p><p><strong>Update #2, Nov 6</strong>: IW .ff and .paks sucessfully decompressed/recompressed, giving significant boost in future repack size.</p><p><strong>Update, Nov 6</strong>: Lossy audio works great in MWR, will be a good option to save traffic. Original lossless will be available of course.</p><p>Well, here we have bad news and good news. Let’s start with bad ones.</p><p>BO3 repack is delayed until MRW repack release. It requires more install tests and that requires much time.</p><p>MWR and IW use different file formats, so they need more time to deal with. With a help of my friend from R.G. Mechanics I’ve successfully uncompressed and recompressed .pak and .ff arhives from MWR. So the compression ratio will be much better than in any other available repack.</p><p>Another thing is moving MP/Zombie files to an optional download. With IW it’s easy, with MWR not that easy, but doable, I guess.</p><p>Do not ask idiotic questions about size and/or time of release. My answer is always the same: When. It’s. Done.</p>             </div>"
}