{
    "link": null,
    "title": "Day of Requests: Stage 1",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><img loading=\"lazy\" class=\"alignleft size-medium wp-image-10150\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2019/07/5-3-200x300.jpg\" alt=\"\" width=\"200\" height=\"300\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2019/07/5-3-200x300.jpg 200w, https://fitgirl-repacks.site/wp-content/uploads/2019/07/5-3-768x1150.jpg 768w, https://fitgirl-repacks.site/wp-content/uploads/2019/07/5-3-684x1024.jpg 684w, https://fitgirl-repacks.site/wp-content/uploads/2019/07/5-3.jpg 1102w\" sizes=\"(max-width: 200px) 100vw, 200px\">I know you’ve been waiting for this for a quite time. Yes! The Great Day of Requests is here!</p><p>It’s divided into two stages. The first one you’re looking at, will end on 21:00 (UTC). While this stage is active, you can name the games you want to be repacked as a single post. You can nominate no more than 3 games, each one in it’s own comment. If you nominate more than 3 games, I or KnowingEyes will delete all your nominations. Before posting your nominees, check if they were already posted, duplicates will be deleted too.</p><p><span style=\"color: #ff0000;\"><strong>Each post with a name can and should be be upvoted by users</strong></span>, so the more votes the game/post receive, the higher chances for it to pass to a Second Stage, which will start several hours after the first ends. You can upvote any number of games, no limits here.</p><p>In the Second Stage Top 30 games which will receive most votes will be put on a separate poll. And Top 7 of the winners will be repacked by me in the near future. I’m not making any promises on the dates, though, since those repacks will have a lower priority compared to fresh releases.</p><p>Some notes:</p><ul><li>You can ask any game you want – it can be a game I never repacked or a game you want to be updated</li><li><span style=\"color: #ff0000;\">Don’t ask for games which has not been cracked yet</span>. Posts will be deleted. You can check the crack status <a href=\"https://old.reddit.com/r/CrackWatch/comments/avrrh6/crack_watch_games/\" target=\"_blank\" rel=\"noopener\">here</a>.</li><li><span style=\"color: #ff0000;\">Don’t ask for series</span>, those will be ignored</li><li>All comments but nominations will be deleted as spam</li><li>No porn/adult games are allowed for nominating/voting. I make those repacks when I feel so 🙂</li><li>Votes will be check after First Stage end for bots involvement, so don’t be stupid</li></ul><h4><span style=\"color: #ff0000;\">Nominating is now closed and only upvoting/downvoting is allowed for a few hours before the second stage will begin.<br></span></h4>             </div>"
}