{
    "link": null,
    "title": "DOOM: IDDQD Repack details",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><img loading=\"lazy\" class=\"alignleft size-full wp-image-1663\" style=\"margin-bottom: 50px;\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2016/09/cover_doom_iddqd.jpg\" alt=\"cover_doom_iddqd\" width=\"210\" height=\"300\">So, when my poll showed, that many of you would like to see ripped version of DOOM, without multiplayer and SnapMap editor, I started to work on it. But since I don’t like the idea of ripping and prefer to give YOU a choice, I’ve managed to make not a rip, but a proper new repack, which allows you to download the game in any form you like – with or without MP and/or SnapMap, as I did with giant Black Ops 3 repack.</p><p>And I didn’t spent my time for nothing. Here are the features of upcoming <span style=\"color: #800000;\"><strong>DOOM IDDQD Repack</strong></span> (named after an infamous cheat code in original DOOM, which gave you a God Mode).</p><div style=\"clear: both; margin-top: 20px; margin-bottom: 20px;\"></div><ul><li><span style=\"color: #008000;\"><strong>Smallest lossless rip/repack in the world</strong></span>: the minimum size is just 27.6 GB, while complete game with Credits/MP/SnapMap is 38.3 GB, 400 MBs smaller, then the previous repack.</li><li><span style=\"color: #008000;\"><strong>Faster installation</strong></span>. Installation time reduced by 10-50%, depending on your hardware. Optimized compression and lower HDD load as a free bonus 🙂</li><li><span style=\"color: #008000;\"><strong>Selective download</strong></span> of optional components: Multiplayer files (for possible future cracks/servers/whatever), SnapMap (so you can create maps if you wish), and Credits video (contains spoilers!). Of course, language selection is intact, as always. Only Premium Service for my dear users 🙂</li></ul><p>There is only one downside with new IDDQD Repack. It’s absolutely <span style=\"text-decoration: underline;\">backwards incompatible</span> with initial repack due to changed compression scheme and new selective download options.</p><p>As for delivery time. I hope to release it tomorrow. But if you already downloaded the first repack, there is no need for a new one. Only if you want to replace the old with new in your collection.</p>             </div>"
}