{
    "link": null,
    "title": "FitGirl Recommends Russian Movies #1",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><img class=\"alignleft size-full wp-image-11207\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2019/11/51rA7NDvocL.jpg\" alt=\"\" width=\"170\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2019/11/51rA7NDvocL.jpg 356w, https://fitgirl-repacks.site/wp-content/uploads/2019/11/51rA7NDvocL-214x300.jpg 214w\" sizes=\"(max-width: 356px) 100vw, 356px\">Being native Russian, I was grown in the mixed environment, but still Russian is my first language, I love it and I love Russian culture and arts, including Russian and Soviet movies. With this topic I want to see if anyone in the world is interested in learning stuff about Russia and Russian people via cinematic experience.</p><p>Let’s start with a comedy. It’s titled “The Irony of Fate, or Enjoy Your Bath!” (Ирония судьбы, или С лёгким паром!) and it was released in 1976, long before my birth. Yet me and millions of other Russian-speaking people watch it every year on a New Year’s eve. It’s kinda premature to show it to you in November, yet it’s a good start. It’s a comedy – but I don’t want to spoil you the story.</p><p>It consists of two series and has subtitles in Russian, English, Spanish, French and Bulgarian.</p><p>Videos are not embeddable, so here are the links to YouTube:<br>Part 1: <a href=\"https://www.youtube.com/watch?v=lVpmZnRIMKs\" target=\"_blank\" rel=\"noopener\">https://www.youtube.com/watch?v=lVpmZnRIMKs</a><br>Part 2: <a href=\"https://www.youtube.com/watch?v=5TmGPeowN-0\" target=\"_blank\" rel=\"noopener\">https://www.youtube.com/watch?v=5TmGPeowN-0</a><br>Magnet: <a href=\"magnet:?xt=urn:btih:415297CD8B2369483E1F5C6A65F4C1677CD9BD25&amp;tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet\">magnet:?xt=urn:btih:415297CD8B2369483E1F5C6A65F4C1677CD9BD25</a></p><p>Let me know in comments if this format is interesting for you, how you find this flick and should I continue this in the future or stick to my repacks 🙂</p><p><span style=\"color: #ff0000;\">Update: So, looks like you people are really interested in that part of the Russian culture. Expect weekly posts with my recommendations for Russian movies and animations.</span></p>             </div>"
}