{
    "link": null,
    "title": "Grand Theft Auto V – FitGirl CorePack",
    "first_img": [],
    "second_img": null,
    "body": "<div ><p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-11727\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2019/12/tatou_sad.jpg\" alt=\"\" width=\"1600\" height=\"921\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2019/12/tatou_sad.jpg 1600w, https://fitgirl-repacks.site/wp-content/uploads/2019/12/tatou_sad-300x173.jpg 300w, https://fitgirl-repacks.site/wp-content/uploads/2019/12/tatou_sad-1024x589.jpg 1024w, https://fitgirl-repacks.site/wp-content/uploads/2019/12/tatou_sad-768x442.jpg 768w, https://fitgirl-repacks.site/wp-content/uploads/2019/12/tatou_sad-1536x884.jpg 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\">Today is a sad day. December 31st is the last day for <div><a href=\"https://corepacks.com/\" target=\"_blank\" rel=\"noopener\">CorePack</a></div>  group and their site. The events that led to the closure are laid out in Raven’s (CP admin) post <a href=\"http://web.archive.org/web/20191231011730/https://corepacks.com/index.php?/topic/69069-its-time-to-say-goodbye/\" target=\"_blank\" rel=\"noopener\">here</a>.</p><p>We always were rivals, as any other repacker, and CorePack was one the most productive group out there. They had their highs and lows, but in a past few years their repacks were almost always w/o errors or ripped stuff, which I count as the main quality descriptive.</p><p>I love competition and current repackers “scene” with dying groups and unskilled individuals is not what compression sportswoman like me would love to see. Competition means evolution. Without it we all are stuck in the same repeating loop of old technologies and methods.</p><p>I will miss CorePack as a very hardcore rival and I really hope that Raven and The Knight will rise like two Phoenixes. I will welcome them with open hands and heart.</p><p>Also I would like to apologize to ShivShubh for wrongfully accusing him as a single public leaker of the stolen CODEX NFSH crack. My head wasn’t cold enough to calculate all variables and take all information into consideration. He wasn’t first, though intentions of publishing it were clear (at least for me). The situtation from Shiv’s point of view can be found in <a href=\"https://old.reddit.com/r/CrackWatch/comments/eh3zst/how_need_for_speed_p2p_stolen_crack_hurts_codex/\" target=\"_blank\" rel=\"noopener\">this Reddit topic</a> and, for some time, <a href=\"http://web.archive.org/web/20191231013144/https://corepacks.com/index.php?/topic/69070-goodbye-to-you-all-6-years-fading-away/\" target=\"_blank\" rel=\"noopener\">on CorePack</a>. Despite all of this I still think that Shiv shouldn’t publish that file and not involve the whole group into shitstorm that happened after.</p><p>We had our fights with Shiv back in the days, on many-many occasions. With my apology I’m burying the hatchet of war on my side. I don’t want to bring all that dark past into 2020 and hope you don’t want it too. I’m sorry.</p><p><del datetime=\"2019-12-31T19:23:10+00:00\"><span style=\"color: #ff0000;\">If you have been CorePacks repack user, please <a style=\"color: #ff0000;\" href=\"https://corepacks.com/index.php?/topic/69069-its-time-to-say-goodbye/\" target=\"_blank\" rel=\"noopener\"><span style=\"text-decoration: underline;\">proceed to this topic</span></a> and say your “goodbye”, they deserve it.</span></del><br>The site went offline. You can now only see the <a href=\"http://web.archive.org/web/20191231011730/https://corepacks.com/index.php?/topic/69069-its-time-to-say-goodbye/\" rel=\"noopener\" target=\"_blank\">saved copy of the page</a>.</p><p>And now onto the repack.</p><p>I was preparing my “Magic Repack” of GTA V for a couple of weeks, if no more. The main intention was to make it even smaller than before and still keep the installation time not too suffering. Another point was the returning of my tiny tradition of ending the year with some GTA title, as it was a few years ago. By the time the repack was almost cooked, the whole NFSH story with CorePack closure happened. And I felt that it would be a right decision to call it FitGirl CorePack as my sign of gratitude to the team, with which we were competing for so many years. GTA V was always a battlefield for me and CP, so it looks like a proper title to have their name too.</p><p>Guys, you will be remembered. But please return.</p><p>GTA V build version (v1.0.1180.1/1.41) didn’t change – there were no new cracks released since 2017. But I’ve managed to reduce the size from 36.2 GB (Lolly Repack) to 30.4 GB, while the installation speed remains the same.</p><p><a href=\"http://fitgirl-repacks.site/grand-theft-auto-v/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-size: 18pt;\">Download FitGirl CorePack</span></a></p><p><span style=\"font-size: 24pt; color: #ff0000;\">Happy New Year, girls and boys! Let’s hope that 2020 won’t be that shitty as last days of 2019.</span></p>             </div>"
}