{
    "link": null,
    "title": "My statement about EMPRESS",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p>As many of you could see, the <strong>Immortals: Fenyx Rising</strong> repack was listed in Upcoming Repacks list for almost a day already. Why is it still not up? You would never guess, EMPRESS intentionally limited the uploading speed of her seedbox to 200 KB/s and feeding the same chunks to the crowd, so no one would download the ISO before others. And my seedbox already uploaded almost 2 TBs of data on that torrent. For the same reason she didn’t share the crack-only files for those, who have the game files already, including all beta-testers, which were helping her to finalize the crack. So almost 24 hours after release, not a single person but her, has the access to the said crack.</p><p>And why did she do it, you ask? The answer is mind-blowing: she hates all repackers for “stealing the spotlight” from her work. Yes, you’ve read it right. If you’re mentally ready, you can google and search her Matrix channel to see for youself. Short story can be found in this <a href=\"https://reddit.com/r/CrackWatch/comments/lp9ae3/immortalsfenyxrisingempress/goc47gg/\" rel=\"noopener\" target=\"_blank\">subtopic</a> on CrackWatch reddit.</p><p>It’s against common logic and piracy ethics.</p><p>Well, your wish will be granted, dear EMPRESS. <strong>I will never make any repacks with your cracks again</strong>. I don’t want to be related to the toxicity you’ve created with your last statements and actions. It was a hard decision for me – I’ve already repacked IFR and upcoming JC4. All future Denuvo+EMPRESS games will now be absent on my site which will be a huge miss for you, my users. But I can’t allow myself to be a puppet of a person, whose main agenda seems to be “I am the only Denuvo-cracker in the world, praise me”.  Well fuck that. I’ll let other repackers with less strict principles to deal with her works.</p><p>Right now her cracks are probably safe for use, but I can’t be sure if it will stay the same and one day she would erase your HDD out of nowhere, if you decide to leave her pseudo-cult chat or think her community is bad.</p><p>Enjoy your spotlight, EMPRESS.</p>             </div>"
}