{
    "link": null,
    "title": "NBA 2K17 Repack Installer Bugfix",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><h4><span style=\"color: #ff0000;\">The fix is ready and tested.</span></h4><p>Get an updated 4 MB <strong>setup-fitgirl-11.bin</strong>:</p><p><a href=\"http://www119.zippyshare.com/v/r6PmHcvI/file.html\" target=\"_blank\">http://www119.zippyshare.com/v/r6PmHcvI/file.html</a></p><p>Overwrite an old copy with this new file and run setup as before.</p><p>The installation now should not trigger any “Unsupported stream type” error at all.</p><p>As I predicted, the installation time increased – for SSDs for around +10 minutes; on HDDs for 30-40 minutes. So this fix is good only if you already have my repack. But if you didn’t get the game yet, wait for tomorrow, when I will release an updated repack with the same installation time, as before, but without this bug. It will be mostly backwards compatible, ~23 GB will be rehasheable with initial repack.</p><p><del datetime=\"2016-09-25T01:10:27+00:00\">If you already got my NBA 2K17 repack, you could already get the notorious “Unsupported stream type” error. While I was doing my tests (I installed the game 5 times), I never experienced this bug. However, after I’ve received so many claims, I’ve concluded more manual tests. In some of them this bug actually appeared for me too. As far as I can tell now, it’s VERY random. You may catch at the beginning, in the middle or in the end of the installation. Or you will get lucky and won’t catch it at all. Users of SSD have the lowest chance, I guess.</del></p><p><del>I don’t like when my repacks don’t work for that many people. This particular bug will be fixed ASAP. I will change the restoration method, which doesn’t use “precomp.inside” functionality at all. There is a drawback – the installation will be slower. I can’t tell for how long yet.</del></p><p><del>The fix for current repack will be small in size and will be released ASAP, probably tomorrow. If the installation will become slow for a huge amount of time, the updated, backwards compatible repack will be released as well.</del></p><p>Sorry for inconvenience, errors happen.</p>             </div>"
}