{
    "link": "https://fitgirl-repacks.site/power-and-revolution-2021-edition/",
    "title": "Power and Revolution 2021 Edition – v6.74-E21 + 2 DLCs",
    "first_img": "https://i3.imageban.ru/out/2022/03/12/aa06e3615bb86e2509508294886a376f.jpg",
    "second_img": "https://s01.riotpixels.net/data/f2/0d/f20da348-3ec0-4a71-b913-f4ea5fb2f869.jpg.240p.jpg",
    "body": "<div ><h2>Power and Revolution 2021 Edition – v6.74-E21 + 2 DLCs</h2><p ><div><a target=\"_blank\" href=\"https://en.riotpixels.com/games/power-and-revolution-2021-edition/\" rel=\"noopener\"><img class=\"alignleft\" width=\"150\" src=\"https://i3.imageban.ru/out/2022/03/12/aa06e3615bb86e2509508294886a376f.jpg\"></a></div><br>Genres/Tags: <strong>Strategy, Isometric, Top-down, Pausable real-time, 2D, 3D</strong><br>Company: <strong>Eversim</strong><br>Language: <strong>ENG</strong><br>Original Size: <strong>3.5 GB</strong><br>Repack Size: <strong>1.7 GB</strong></p>&nbsp;<div>&nbsp;</div><h3>Download Mirrors</h3><ul><li><a href=\"https://1337x.to/torrent/5180190/Power-and-Revolution-2021-Edition-v6-74-E21-2-DLCs-FitGirl-Repack/\" target=\"_blank\" rel=\"noopener\">1337x</a> | [<a href=\"magnet:?xt=urn:btih:F86C7F3E9797E7CCF5F7B12ABE5F32094293AB1C&amp;dn=Power+and+Revolution+2021+Edition+%28v6.74-E21+%2B+2+DLCs%29+%5BFitGirl+Repack%5D&amp;tr=udp%3A%2F%2F46.148.18.250%3A2710&amp;tr=udp%3A%2F%2Fopentor.org%3A2710&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&amp;tr=http%3A%2F%2Ftracker.dler.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2F9.rarbg.me%3A2730%2Fannounce&amp;tr=udp%3A%2F%2F9.rarbg.to%3A2770%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.pirateparty.gr%3A6969%2Fannounce&amp;tr=http%3A%2F%2Fretracker.local%2Fannounce&amp;tr=http%3A%2F%2Fretracker.ip.ncnet.ru%2Fannounce&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Fipv4.tracker.harry.lu%3A80%2Fannounce&amp;tr=udp%3A%2F%2Fopen.stealth.si%3A80%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.zer0day.to%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Fcoppersurfer.tk%3A6969%2Fannounce\">magnet</a>] [<a href=\"https://pastefg.hermietkreeft.site/?c2dd107546d7849d#Gg6PMe5pC4WkwCgtvRgqPKuNRYpvfEFwBYXLqGQpsLJu\" target=\"_blank\" rel=\"noopener\">.torrent file only</a>] <br><img src=\"https://torrent-stats.info/b12a/3512d4d22.png\" style=\"display:block;clear:both\"></li><li><a href=\"https://tapochek.net/viewtopic.php?p=2839600\" target=\"_blank\" rel=\"noopener\">Tapochek.net</a></li><li><a href=\"https://pastefg.hermietkreeft.site/?baf9363f6711ed27#GkWAj1yHbUvTiZSXNcf3QpSFXVzWBxgNH2y8oP6z4S1S\" target=\"_blank\" rel=\"noopener\">Filehoster: MultiUpload</a> (10+ hosters, interchangeable) [Use <a href=\"http://jdownloader.org/jdownloader2\" target=\"_blank\" rel=\"noopener\">JDownloader2</a>]</li><li><a href=\"https://pastefg.hermietkreeft.site/?4926a39f768ded6a#2xM1AFN4yBPvTYsWdVHvaJsCBfbBLg2LWNMYEpXQoVZZ\" target=\"_blank\" rel=\"noopener\">Filehoster: ZippyShare</a></li><li><a href=\"https://pastefg.hermietkreeft.site/?a5b3fd51a4b862f1#BdnAzK34Gjc6tQpHdgPaJFirvVAde8tThu4UYgLuKe9d\" target=\"_blank\" rel=\"noopener\">Filehoster: BayFiles</a></li><li><a href=\"https://pastefg.hermietkreeft.site/?35b654c00de612fe#BLBNcpP7SgMnyvRoVHizt3VsazRrTCzekhKctnwgspMP\" target=\"_blank\" rel=\"noopener\">Filehoster: OneDrive</a> (Uploaded by DyR0 t(-_-t), NOT compatible with other mirrors)</li><li><a href=\"https://crackhub.site/power-and-revolution-2021-edition-v6-74-e21-2-dlcs-fitgirl-repack/\" target=\"_blank\" rel=\"noopener\">Filehosters: Google Drive, OneDrive + others</a> (Uploaded by crackhub213)</li></ul><p><a href=\"https://cs.rin.ru/forum/viewtopic.php?f=10&amp;t=71266\" target=\"_blank\" rel=\"noopener\">Discussion and (possible) future updates on CS.RIN.RU thread</a></p><h3>Screenshots (Click to enlarge)</h3><p><a target=\"_blank\" href=\"https://en.riotpixels.com/games/power-and-revolution-2021-edition/screenshots/16/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/f2/0d/f20da348-3ec0-4a71-b913-f4ea5fb2f869.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/power-and-revolution-2021-edition/screenshots/12/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/cc/ba/ccba1af3-dffe-4e10-a949-a9ef39af5f7a.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/power-and-revolution-2021-edition/screenshots/9/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/71/f3/71f3d38b-8e2c-45d0-a3e6-95d1798213d7.jpg.240p.jpg\"></a><br><a target=\"_blank\" href=\"https://en.riotpixels.com/games/power-and-revolution-2021-edition/screenshots/6/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/d7/0e/d70e459e-e489-43ca-aba3-61ffcbae382b.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/power-and-revolution-2021-edition/screenshots/3/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/37/24/3724966e-6034-49c6-b6b7-7ef2a89f1a4d.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/power-and-revolution-2021-edition/screenshots/2/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/f8/fb/f8fb315c-ef4e-45c3-a77d-f5e5f8a58b48.jpg.240p.jpg\"></a></p><h3>Repack Features</h3><ul><li>Based on Power.And.Revolution.2021.Edition-SKIDROW ISO release: sr-powerandrevolution2021edition.iso (3,811,461,120 bytes)</li><li>Game version: v6.74-E21; 2 DLCs are included and activated</li><li>100% Lossless &amp; MD5 Perfect: all files are identical to originals after installation</li><li>NOTHING ripped, NOTHING re-encoded</li><li>Significantly smaller archive size (compressed from 3.5 to 1.7 GB)</li><li>Installation takes 3-7 minutes (depending on your system)</li><li>After-install integrity check so you could make sure that everything installed properly</li><li>HDD space after installation: 7.1 GB</li><li>Repack uses XTool library by Razor12911</li><li>At least 2 GB of free RAM (inc. virtual) required for installing this repack</li></ul><div ><div><h2>Game Description</h2></div><div ><p>In Power &amp; Revolution 2021 Edition, play as the Head of State and extend your influence around the globe. By playing as several countries, try to change the destiny of our planet with orchestrated actions. Play as the head of the legal or illegal opposition and seize power!</p><p><b>STRATEGY, SIMULATION AND MANAGEMENT</b><br>Power &amp; Revolution is a simulation of our current world, recreating its features in-depth and across a number of domains: economic, political, military, social, financial, environmental, energetic, transportation…</p><p>All countries of the world are represented with their own features. The calculation and scenario engines include more than 100,000 data, 15,000 texts and 10 hours of recorded dialogue. A detailed and animated 3D world map helps to support the players, with all the borders, regions and important and strategic locations of the world</p><p>The game combines management stages of economics, commerce, wargames, construction, espionage, simulation, and political influence and manipulation.</p><p>Players can opt for the management of just one country or several simultaneously and design collaborative strategies to change the world’s destiny. There are game settings across multiple domains: degree of activity of terrorist organizations, probabilities of natural disasters, reactivity of populations, outbreak of wars. More than twenty contextual scenarios with current events from today’s world are integrated.</p><p><b>2021: A YEAR OF CHALLENGES!</b><br>In 2020, the pandemic flattened economies, sent debt through the roof and increased economic insecurity. But at the beginning of 2021, hope was reborn with the arrival of vaccines against Covid-19: the end of the health crisis and the return of growth are on the horizon and with the inauguration of the new American president, a new era of diplomacy has also begun.</p><p>As head of one or several nations, win the battle against the virus by carrying out a vaccination campaign, revitalize your economy and move your pawns on the political chessboard with new strategies: the creation of party coalitions, negotiations during meetings of heads of state, free-trade agreements, worldwide taxes, diplomatic initiatives (scientific cooperation, student exchanges, year of culture)…</p><p>In a vast, highly realistic simulation of the European Union, there are many political conundrum to solve if you want to develop the organization: voting and institutional operation rules, detailed budgets, new taxes, fiscal or social harmonization, commercial agreements…</p><p>And there are other challenges to face: in “Biden’s Challenge”, try to reach your ambitious goals as the new American head of state; participate in the German federal elections and if you win, try to form a coalition to govern the country; and with the new worldwide fatality management system, take action to reduce their impact and limit the number of deaths.</p><p><b>A TOTALLY UNIQUE SIMULATION ENGINE:</b><br>The game engine, Geopolitical Simulator 4, includes over 600 data elements for each of the 175 playable countries and calculates their changes in real time throughout the game based on players’ actions. Some examples include popularity ratings, political relations, and economic exchanges between countries. Various organizations, including NATO, use the technologies in the Power &amp; Revolution simulator for education and training.</p><p>Over one thousand playable actions. At the country’s helm, the player/head of state can act in many areas: budget, taxation (nearly thirty types of taxes), currency, economy (over 130 economic activities), foreign and domestic affairs, defense, society, labor, health, social security, education, environment, transportation, culture, and more.</p><p>Propose bills to be voted on in Parliament, for example: setting social welfare benefit minimums, changing the retirement age, developing atomic weapons in secret, subsidizing the auto industry, hiring teachers, defining the powers of unions, setting speed limits on roads, regulating prostitution, creating an international film festival, etc.</p><p>The player can also construct elements on the world map, which will change accordingly: nuclear plants, wind farms, military bases, pipelines, high-speed train lines, airports, and many more.</p><p><b>SIMULATIONS OF MAJOR GLOBAL THREATS:</b><br>The Geopolitical Simulator 2021 Edition simulates all the major perils that threaten the planet and produces a comprehensive assessment for each one from the results along with specific graphics. The list of threats is substantial and many of them are interconnected: global warming, the widening of social inequality, the risk of global atomic war, overpopulation, unemployment, atmospheric pollution, terrorism, cybercrime, regional conflicts, food insecurity, world hunger, deforestation, natural disasters (storms, floods, drought, extreme heat…), rising sea levels, ocean acidity, disappearance of animal species, climate refugees, epidemics, endocrine-disrupting chemicals…</p><p><b>PLAY AS THE OPPOSITION:</b><br>At the head of a legal or illegal organization, the player can take power by force, revolution, diplomacy, or democratic election. To that end, players have many actions at their disposal: manage the budget of the party or illegal organization, intervention in the media, give voting advice to Parliament, launch protest movements, lobbying, manipulation of influential persons, funding or recruitment campaigns, creation of violent cells, purchase military equipment, raise an army, seek allies, engage in armed conflict… During elections, players must manage their campaign budget, establish their political agenda, complete their meeting itinerary, confront their adversary in televised debates…</p><p><b>AI CONTROLLED LOBBYISTS AND CHARACTERS:</b><br>All actions of the player as head of state or opposition have repercussions and lobbies, social groups, and important national and international figures will intervene if their artificial intelligence deems necessary (press interviews, resignations, protests, strikes, unrest, blocked roads, wars…).To prevent tensions or forge alliances, the player can meet any figure during the meeting or intervene in the media (more than 10 hours of dialogue in the game).</p><p><b>REALISTIC WARGAMES AND CITY BATTLE PHASES:</b><br>The world map incorporates all places of conflict down to the smallest detail: occupied territories, besieged cities, locations of military units, international military bases, personnel and equipment of terrorist groups…</p><p>As a warlord, players can direct all of their units from real bases during military conflicts. City battles are shown on precise maps with all the major buildings and intersections. The players, according to the side they represent, can direct police, hooligans, military personnel or armed extremists to these locations and construct barricades, send in snipers, loot the banks, or have armoured vehicles move in.</p><p><b>SECRET SERVICES:</b><br>Secret services play an important role. They have an arsenal of espionage and \\”special\\”” operations: reveal scandals about an opposing political party, dismantle terrorist networks, sabotage foreign infrastructure, assassinate an opponent, send reconnaissance drones or position satellites to locate enemy units, etc.</p><p><b>INTERNATIONAL ORGANIZATIONS:</b><br>International organizations (over 50 organizations included) play an important role. At the UN, for example, the player can denounce a nation in order to obtain the Security Council’s authorization for a military intervention. The player can also create his or her own organization.</p><p><b>MAIN NEW FEATURES FOR 2021 EDITION:</b><br>Administration of the EU, Covid vaccinations, Biden’s Challenge, political coalitions, diplomatic negotiations, worldwide tax and free-trade agreements etc..</p><p><b><h3>Game Features</h3></b></p><ul><li>Game operating as single-player with a multi-country mode allowing play with several countries simultaneously</li><li>Game settings: terrorist activities, probabilities of natural disasters, reactivity of the populations, outbreak of war</li><li>Player ranking online and in real time</li><li>Incorporation of your own photos, logos, names to make the game even more realistic</li><li>Interactive tutorial and game help available at all times during the game (in beginner mode)</li><li>Learn about geopolitics by playing the QUIZZ mode, including more than 3000 questions</li><li>Enjoy different configurations with double screen or 4K screen offering a customized interface</li><li>Avec l’extension Modding Tool, (add-on prochainement en vente sur ce site), vous aurez la possibilité de créer et de partager vos propres scénarios et contextes géopolitiques ou bien de télécharger ceux des autres utilisateurs</li><li>With the Modding Tool extension (add-on soon available for purchase on this site), you’ll be able to create and share your own geopolitical scenarios and contexts or even download those of other users</li><li>Text and dialog 100% in English</li><li>God’n’spy: expanded view of the composition of strategic and economic alignments among the countries (organizations, communities, surroundings, political tendencies, religious communities…)</li><li>Water cannon: add a water cannon vehicle in city riots to disperse demonstrators in a wide area and block access without resorting to lethal force.</li><li>Loan buybacks for the player and, thanks to a treasury reserve, not have to resolve any remaining interest</li><li>Map of political tendencies displaying the tendencies of governments in power over the entire planet</li><li>Map of European Union regions, with each region of the EU color-coded based on its economic development ranking</li><li>Calculation and display of organizational effectiveness on the economic (growth points gain) and military level</li><li>New management of tariffs including international agreements and the initialization of actual revenue</li><li>Refined city/region selection on the map</li><li>New achievements</li><li>64 bit engine: between 10% to 25% speed increase for passing “1 month”, 10% speed increase for loading a game.</li></ul><p><b>Included DLCs:</b></p><ul><li>God’n Spy Add-on</li><li>Modding Tool Add-on</li></ul></div></div>             </div>"
}