{
    "link": null,
    "title": "Russian Movies Weekend #3",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p>This weekend I present you one comedy and one very sad and creepy animation. Choose what poison you will eat first, but you definitely should swallow both of them.</p><h2>Russian Movies Weekend #3</h2><p>This animation is based on Ray Bradbury’s <a href=\"https://en.wikipedia.org/wiki/There_Will_Come_Soft_Rains_(short_story)\" target=\"_blank\" rel=\"noopener\">short story</a> with the same name. It was released back in the 1984 by Uzbekfilm. I watched as a child and it kicked me in the nut back then and still I find it very stressful to watch. The quality of the YT sucks big time, but it’s enough to feel the story.</p><p><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/5LNHYz89sNc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><h3>The Diamond Arm (Бриллиантовая рука), USSR, 1969</h3><p>And this is just for lulz. Here’s the excerpt from Wikipedia:<br><em>The Diamond Arm (Brilliantovaya ruka) is a Soviet comedy film made by Mosfilm and first released in 1969. The film was directed by director Leonid Gaidai and starred several famous Soviet actors, including Yuri Nikulin, Andrei Mironov, Anatoli Papanov, Nonna Mordyukova and Svetlana Svetlichnaya. The Diamond Arm has become a Russian cult film and is considered by many Russian contemporaries to be one of the finest comedies of all time. It was also one of the all-time leaders at the Soviet box office with over 76,700,000 theatre admissions in the Soviet era. The plot of the film was based on a real-life news item about Swiss smugglers who tried to transport jewels in an orthopedic cast.</em></p><p><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.invidious.tube/embed/IvVpbNaSk6k\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p><p>Or <a href=\"https://www.youtube.com/watch?v=IvVpbNaSk6k\" rel=\"noopener\" target=\"_blank\">watch on YouTube</a>.</p>             </div>"
}