{
    "link": null,
    "title": "The Day of Requests on May 13, mark your calendar",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-3895\" src=\"https://fitgirl-repacks.site/wp-content/uploads/2017/05/requests_day.jpg\" alt=\"\" width=\"1024\" height=\"587\" srcset=\"https://fitgirl-repacks.site/wp-content/uploads/2017/05/requests_day.jpg 1024w, https://fitgirl-repacks.site/wp-content/uploads/2017/05/requests_day-300x172.jpg 300w, https://fitgirl-repacks.site/wp-content/uploads/2017/05/requests_day-768x440.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\"></p><p>I didn’t make The Day of Requests for a long time. So here are the rules.</p><ol><li>TDoR will start on 00:00 GMT of May 13 and will end on 24:00 GMT of May 13 – use <a href=\"http://www.thetimezoneconverter.com/\" target=\"_blank\" rel=\"noopener\">this site</a> to convert GMT to your timezone</li><li>TDoR will be divided into three parts: in 1st (00:00-10:00 GMT) all users may suggest their games for repacking; in 2nd (10:00-12:00) I combine all those requests into a poll; in the final, 3rd part (12:00-24:00) the poll is open for voting.</li><li>On the next day, May 14, I will announce from 7 to 10 repacks, based on public voting results. The number will depend on my mood on that day.</li><li>The following games <strong>CANNOT</strong> be requested and will be <strong>IGNORED</strong> while combining the poll: games I already repacked (doesn’t matter if there are newer versions available); game series/anthologies requests; bypassed games (i.e. Forza Horizon 3), uncracked games (i.e. Gears of War 4); console games (i.e. PS3, PS4, WiiU exclusive titles); games older than 10 years.</li><li>One person can request only one game – IP/behaviour logging will be in place for checking. Read other requests before typing anything to make no dupes.</li><li>I won’t announce the order of repacking of winners, but they will be put into my queue and will be made asap.</li><li>These rules may change any time.</li></ol><p>So, if you really wanted to make a request – come to my site on May 13 and participate. If crowd will support your choice – you’ll get my fit and beatiful repack 😉</p>             </div>"
}