{
    "link": "https://fitgirl-repacks.site/the-wind-road/",
    "title": "The Wind Road – v1.9.1 + DLC + Wallpapers",
    "first_img": "https://i7.imageban.ru/out/2022/01/21/3562868d23adc90d2f78c17695112385.jpg",
    "second_img": "https://s01.riotpixels.net/data/c9/8c/c98c2671-c566-470a-b477-715f967a5be9.jpg.240p.jpg",
    "body": "<div ><h2>The Wind Road – v1.9.1 + DLC + Wallpapers</h2><p ><div><a target=\"_blank\" href=\"https://en.riotpixels.com/games/wind-road/\" rel=\"noopener\"><img class=\"alignleft\" width=\"150\" src=\"https://i7.imageban.ru/out/2022/01/21/3562868d23adc90d2f78c17695112385.jpg\"></a></div><br>Genres/Tags: <strong>Action, Third-person, 3D</strong><br>Companies: <strong>Gansu Jiayuan Digital Technology, Fhyx</strong><br>Languages: <strong>ENG/MULTI3</strong><br>Original Size: <strong>31.5 GB</strong><br>Repack Size: <strong>16.5 GB</strong></p>&nbsp;<div>&nbsp;</div><h3>Download Mirrors</h3><ul><li><a href=\"https://1337x.to/torrent/5122391/The-Wind-Road-v1-9-1-DLC-Wallpapers-MULTi3-FitGirl-Repack/\" target=\"_blank\" rel=\"noopener\">1337x</a> | [<a href=\"magnet:?xt=urn:btih:D9B89952DD81E3C9553873468013473C9169C4EC&amp;dn=The+Wind+Road+%28v1.9.1+%2B+DLC+%2B+Wallpapers%2C+MULTi3%29+%5BFitGirl+Repack%5D&amp;tr=udp%3A%2F%2F46.148.18.250%3A2710&amp;tr=udp%3A%2F%2Fopentor.org%3A2710&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&amp;tr=http%3A%2F%2Ftracker.dler.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2F9.rarbg.me%3A2730%2Fannounce&amp;tr=udp%3A%2F%2F9.rarbg.to%3A2770%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.pirateparty.gr%3A6969%2Fannounce&amp;tr=http%3A%2F%2Fretracker.local%2Fannounce&amp;tr=http%3A%2F%2Fretracker.ip.ncnet.ru%2Fannounce&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Fipv4.tracker.harry.lu%3A80%2Fannounce&amp;tr=udp%3A%2F%2Fopen.stealth.si%3A80%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.zer0day.to%3A1337%2Fannounce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&amp;tr=udp%3A%2F%2Fcoppersurfer.tk%3A6969%2Fannounce\">magnet</a>] [<a href=\"https://pastefg.hermietkreeft.site/?90d62b69e3d4646d#12KJrkEnNnQxhvWeCz1PGxsxRQCTPViW9pzMS8vJ78a7\" target=\"_blank\" rel=\"noopener\">.torrent file only</a>] <br><img src=\"https://torrent-stats.info/7346/222978b40.png\" style=\"display:block;clear:both\"></li><li><a href=\"https://tapochek.net/viewtopic.php?p=2697450\" target=\"_blank\" rel=\"noopener\">Tapochek.net</a></li><li><a href=\"https://pastefg.hermietkreeft.site/?72e38cafaeb5768f#7YAsJSEh2UHFT7dpfmqmaFc7W8oPF4kftZZ8MZGj2BNY\" target=\"_blank\" rel=\"noopener\">Filehoster: MultiUpload</a> (10+ hosters, interchangeable) [Use <a href=\"http://jdownloader.org/jdownloader2\" target=\"_blank\" rel=\"noopener\">JDownloader2</a>]</li><li><a href=\"https://pastefg.hermietkreeft.site/?60aab316473bbd16#5pVdykboR32XR4xcsvQZ4QK6AxWunzwphcYnrwCux7Ag\" target=\"_blank\" rel=\"noopener\">Filehoster: ZippyShare</a></li><li><a href=\"https://pastefg.hermietkreeft.site/?31be1131a18c3c29#6jQbPviT9nRtwX5gsKKhtuUKjcsyBVQJ7T7ZepKFa3yE\" target=\"_blank\" rel=\"noopener\">Filehoster: BayFiles</a></li><li><a href=\"https://pastefg.hermietkreeft.site/?e05a5e974f8801ea#CwSiktrzrPdKX1CARfnJ43sniHdmGxFP4RqkWoxiXfVw\" target=\"_blank\" rel=\"noopener\">Filehoster: OneDrive</a> (Uploaded by DyR0 t(-_-t), NOT compatible with other mirrors)</li><li><a href=\"https://crackhub.site/the-wind-road-v1-9-1-dlc-wallpapers-fitgirl-repack/\" target=\"_blank\" rel=\"noopener\">Filehosters: Google Drive, OneDrive + others</a> (Uploaded by crackhub213)</li></ul><p><a href=\"https://cs.rin.ru/forum/viewtopic.php?f=10&amp;t=104727\" target=\"_blank\" rel=\"noopener\">Discussion and (possible) future updates on CS.RIN.RU thread</a></p><h3>Screenshots (Click to enlarge)</h3><p><a target=\"_blank\" href=\"https://en.riotpixels.com/games/wind-road/screenshots/20/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/c9/8c/c98c2671-c566-470a-b477-715f967a5be9.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/wind-road/screenshots/15/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/35/81/3581d1fc-43b6-481b-b496-448ce9534c86.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/wind-road/screenshots/13/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/a3/93/a393b81e-94dd-4dbf-8d65-cf515e4c0af7.jpg.240p.jpg\"></a><br><a target=\"_blank\" href=\"https://en.riotpixels.com/games/wind-road/screenshots/8/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/72/2a/722a1045-112b-4998-8870-c5d3f9f3dbf4.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/wind-road/screenshots/7/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/76/01/76010ac9-e0ce-440e-a518-be1f2c2ceb1b.jpg.240p.jpg\"></a><a target=\"_blank\" href=\"https://en.riotpixels.com/games/wind-road/screenshots/3/?utm_source=emb-gfx-html&amp;utm_medium=image&amp;utm_campaign=rp-mass\" rel=\"noopener\"><img loading=\"lazy\" width=\"178\" height=\"100\" border=\"0\" src=\"https://s01.riotpixels.net/data/42/73/42730219-601f-47dd-8d4f-bf0f556907be.jpg.240p.jpg\"></a></p><h3>Repack Features</h3><ul><li>Based on The.Wind.Road.v1.9.1-DARKSiDERS ISO release: ds-thewindroadup.iso (33,769,969,664 bytes)</li><li>Arena Challenge DLC and bonus wallpapers are included</li><li>100% Lossless &amp; MD5 Perfect: all files are identical to originals after installation</li><li>NOTHING ripped, NOTHING re-encoded</li><li>Significantly smaller archive size (compressed from 31.5 to 16.5 GB)</li><li>Installation takes 4-8 minutes (depending on your system)</li><li>After-install integrity check so you could make sure that everything installed properly</li><li>HDD space after installation: 36.7 GB</li><li>Language can be changed in game settings</li><li>At least 2 GB of free RAM (inc. virtual) required for installing this repack</li></ul><div ><div><h2>Game Description</h2></div><div >“The Wind Road” is an ARPG real-time combat game, constructing a martial-arts world based on the ancient Silk Road under the background of a fictional era.<p>The Barbarians of Grey Wolf have invaded the Silk Road for hundred years! Now they have sent troops to Shazhou with a purpose to capture the important site of Longyou, threatening the safety of tens of thousands of common people.</p><p>At this time, the Great Karma Scripture emerges and becomes the key to reverse the fate of Shazhou and even the entire Longyou trade route. The Barbarians are strictly preventing the monks (Scripture Escorts) from sending the Scripture to the Imperial Court, while all the forces in Jianghu who covet the Scripture’s secret also go into action. The character’s task is originally to help the decent sects escort the monks on their mission. However, he uncovers the secret of Scripture coincidentally after suffering a variety of trails and setbacks in ten days!</p><p>Finally, in the choice of fate, the character has to undertake the mission and becomes a real hero, taking the first step to stop the chaos of the world…</p><p>As a real-time combat martial-arts ARPG game, its core gameplay is combat. Various elements determine the Role’s combat rhythm.</p><p><b><h3>Game Features</h3></b></p><ul><li><b>[Health]:</b> The character’s Health, determines the his survival time in combat. “Grows through the cultivating the Inner Qi Method and taking mediciness.”</li><li><b>[Qi]:</b> Value of the character’s Qi, required to use Internal Moves (QER skills). “Grows through cultivating Inner Qi Method and taking medicine.”</li><li><b>[Stamina]:</b> Value of the character’s stamina, determines the frequency of his Sprint, Roll, and Block. “Grows through cultivating the Inner Qi Method and taking medicine.”</li><li><b>[Rage]:</b> Value of the character’s rage, gathers when he suffers attacks. Once the rage reaches a certain amount, he can perform a swift move that breaks the enemy’s defense. (Based on the weapons on the back.)</li><li><b>[Dodge]:</b> Use the Lightness Technique “Traceless” to get out of the melee area of the enemy instantly.</li><li><b>[Roll]:</b> Roll over to avoid the attacks from the enemy. The distance of a roll is longer and can be used together with dodge.</li><li><b>[Block]:</b> Use up stamina to block attacks from the enemy.</li><li><b>[Insight]:</b> Critical attacks in a hopeless situation. In combat, whether you are attacking or defending, once you see through the flaws of the enemy, you can easily reverse the combat situation. It greatly increases the contingency of the situation and shows the exciting and real combat in Jianghu. Perform it by blocking at the moment (Sword Riposte) the enemy attacks, or by using the special Inner Qi Method.</li><li><b>[Real-time Combat Martial Arts]:</b> The core gameplay of this title is immersive real-time combat. When facing fierce enemies, players have to deal with them through Block, Dodge, Insight, Response, and other techniques. Players can have endless fun in real-time combat and can combine different martial-arts moves, forming their combat ideas and styles.</li><li><b>[Swordplay]:</b> A sword is always the favorite weapon of every Xia. In this title, players can use various kinds of Swordplay and perform natural and smooth sword moves. (Can block and perform Sword Riposte, but cannot use Hidden Weapons.)</li><li><b>[Fist &amp; Palm]:</b> Whether in actual combat or movies and novels, Fist and Palm techniques are the essential elements of martial arts. In this title, Palm Blaster supported by Inner Qi is not the only thing to be seen, but also the Wing Chun and Drunken Boxing. The powerful Palm Blaster is the best choice for dealing with the ranged enemies. (Can use Hidden Weapons, but cannot block; Costs a lot of Stamina)</li><li><b>[Response]:</b> Moves of player can also be seen through and solved by the enemy, causing the Blade Impact effect.</li><li><b>[Inner Qi Response]:</b> The player’s Inner Qi can be offset by the enemy’s. Just think about the impact effect between Dragon-subduing Palms and Intangible Swords. Meanwhile, the Inner Qi can also destroy some objects in the scene.</li><li><b>[Inner Qi Method &amp; Meridians]:</b> In this title, there are 6 different kinds of Inner Qi Methods and 6 completely different ways to play, which are different for combat and healing. For example: “Arts of Violet Mist” is specially designed for hardcore players. It has super low Health and powerless blocks but provides sufficient Qi and Crit Damage. While “Sinew-changing Classic” has sufficient Health, but to Buddha’s mercy, it will not cause Crit or hit the enemy’s weakness, however, it can transfer the damage suffered and has a great effect on healing wounds and resisting Internal Injuries.</li><li><b>[Inner Qi–Psi-Sword]:</b> When the player activates the Inner Qi Method, different Psi-Sword effects will be generated, depending on the special effect of the Inner Qi used. Once this effect is triggered, the player has to use the precious seconds to defeat the enemy. For example, the effect of “Arts of Cloud Dragon” will make all the Sword Moves available to the player, and each move will break the enemy’s defense.</li><li><b>[Sword Holding]:</b> The player needs to take any possible chance to get into the Sword Holding status, speeding up the recovery rate of Qi and Stamina.</li><li><b>[60+ Combinations of Martial-art Moves]:</b> A set of the martial-art system consists of 6 moves, including 3 External Moves (Combos) and 3 Inner Qi Methods (QER Skills that cost Qi). These moves have different gestures to be explored and can be combined by players, to create their martial-art style. (In combat, the player can adjust martial-art moves and Inner Qi used at any time, but it will cost additional EXP.)</li><li><b>[Hidden Weapons]:</b> To make a life in Jianghu, Hidden Weapons are essential. By collecting or crafting, you can acquire various kinds of Hidden Weapons (Poisoned Dart, Leaf Blades, Throwing Knife, Darts, Date Pit). Each Hidden Weapon has its effect, so use wisely in combat.</li><li><b>[Weapon Refining]:</b> In this title, players can consume materials to acquire various weapon refining effects, such as Sharpening (Weapons become sharper in a short time, causing Bleeding to the enemy), Poisoning (Weapons become poisoned, causing Poison Damage to the enemy for some time), Frosting (Weapons are dealt with low temperature, increasing Crit Damage for some time).</li><li><b>[Equipment Appearance]:</b> In this title, there are various equipment appearances, including Masks, Bamboo Hat, Weapons, Back Decorations, Rings, and so on. Once the equipment is changed, there will not only be a change in the appearance, but also a bonus to some attributes.</li><li><b>[Mounted Archery]:</b> In some special levels, the player can use the king of the cold era weapon: Bow &amp; Arrows! On the rugged terrains, the player should judge calmly and give the enemy a critical attack with a fine bow, or penetrate several pursuing enemies with one shot.</li><li><b>[Endurance]:</b> Some martial-arts moves have the effect of ” Endurance” so that you will not be interrupted by an injury.</li><li><b>[Meditation]:</b> Meditation in real combat is also filled with accidents. It’s your sharp eyes and agile hands that keep you alive.</li><li><b>[Drunken System]:</b> Players will get drunk if they drink too much. And in this status, they can perform special martial-art moves (such as Drunken Boxing, Taibai Swordplay) to increase combat strength.</li><li><b>[Craft]:</b> Players can use the materials collected in the game to craft various kinds of medicines and darts.</li><li><b>[Enhance]:</b> Players can use the materials collected in the game to enhance and repair weapons</li><li><b>[Collect]:</b> Players can collect various kinds of crafting materials through missions and explorations.</li><li><b>[Exploration &amp; Puzzles]:</b> Dubbing throughout, the world view depends on the player’s exploration, snooping, reading, letters, and collection. A lot of puzzle-solving and exploration elements are incorporated.</li><li><b>[Internal Injury]:</b> Enemies with strong Inner Qi can deal Internal Injuries to the player, divided into “Ying”, “Yang” and “Severe Injury”. It is necessary to treat the injury or take medicines according to different injuries. If not, the adverse effect will be more serious.</li><li><b>[Poisoned]:</b> Cause poison effect to the player, losing Vitality over time.</li><li><b>[Sinew-broken]:</b> Cause “None Lightness Technique ” effect to the player, rendering them unable to perform Lightness Techniques such as Dodge, Roll, etc.</li><li><b>[Insight]:</b> Tough opponents can also break down your moves.</li><li><b>[Break]:</b> Continuous strikes from an opponent will make the player unable to block and suffer the Break effect.</li><li><b>[Reverse – Sword Riposte]:</b> When facing your Sword Riposte, the tough opponents will also have their solutions.</li><li><b>[100+ NPCs &amp; Arena Challenge]:</b> There are more than one hundred NPCs in this title, as well as hundreds of combatable rangers in Jianghu. Players can acquire abundant rewards by challenging rangers and masters at the Arena or Gambling House in Lianshuo Town.</li><li><b>[Multiloop Inheritance]:</b> This title features a multi-loop inheritance system. In multi-loop games, crafting materials, Funds, Equipment, Martial Arts, Internal Force, Martial-arts Basis, and game clearance rewards will be inherited in a new game. Meanwhile, to avoid boring multi-loop games, players can explore the unexplored content in the previous playthrough, such as some branches in the main story.</li></ul></div></div><p><b>Backwards Compatibility</b></p><p>This repack IS NOT backwards compatible with my previous TWR repack.</p>             </div>"
}