{
    "link": null,
    "title": "Why GOG Offline Installers Suck",
    "first_img": [],
    "second_img": null,
    "body": "<div class=\"entry-content\"><p><img src=\"https://ic.pics.livejournal.com/anna_rina/49492649/304806/304806_original.gif\" width=\"100%\"></p><p>GOG is a great company, with some problems here and there, but they try to follow the DRM-free path they have chosen. But there is one little fucking problem, which makes me fucking mad.</p><p>GOG, your offline installers SUCK. And your engineer(s), who’s responsible for them should be fired, then hanged, then burnt (order can be changed).</p><p>So, why do they suck you may ask? Around 2-3 years ago GOG switched from old installers, which have been using RAR archives as containers to a new scheme. And it’s fucking abysmal. Lemme tell you how it works.</p><p>So, while preparing data for their installers, GOG do the following:</p><ul><li>Every game game file is splitted to a relatively small chunks of data</li><li>Every chunk is compressed with ZLIB algo (the same which used in generic ZIP archives)</li><li>Every chunk’s name is hashed/randomized and then put into INNO Setup container with another ZLIB compression over. This stage alone is crazy – you can’t compress compressed data, only make it larger.</li><li>INNO container is splitted to relatively large BIN files of ~ DVD size.</li></ul><p>So if you think it wasn’t crazy enough (compared to RAR compression), hear how their installers behave on your PC.</p><ul><li>Each chunk is copied to your user temp folder (usually it’s located on a system drive, which now is often and SSD with a limited lifetime and size)</li><li>Every chunk is unpacked and then concatenated into a single original file</li><li>AFTER that this new file is copied to the destination folder from that temporary folder</li></ul><p>So, if your system drive is small, you won’t be able to install a GOG game. You will see “not enough free space” only because fucking idiots in GOG don’t know how to make modern installers which don’t use temp folders and can decompress data directly from source to destination. Every pirated scene setup is better than GOG. They all use FreeArc-created archives with very fast yet relatively good compression, which installs faster than you HDD can process. NOT the case of GOG installers, which can be as slow as fuck. Can you imagine, that even their old RAR installers were much faster and smaller due to usage of solid compression option and direct decompression?</p><p>If you’re a victim of their installers, there is a fucked-up “<a href=\"https://www.gog.com/forum/general/offline_game_installers_why_use_ctemp\" rel=\"noopener\" target=\"_blank\">workaround</a>” for that. But seriously, changing Windows variables or using junction points to another drive only because GOG engineers get they salary for nothing? Sheesh.</p>             </div>"
}